# Задача 12:
# Петя и Катя – брат и сестра.
# Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
#
# Ввод:
# 7
# 12
# Вывод
# 3 4 или 4 3

sum = int(input("Enter sum two numbers: "))
mult = int(input("Enter multiplication two numbers: "))

text = ''  # пустая строка
for i in range(1, sum):
    if (sum - i) == (mult / i):
        text += f'(X = {i}, Y = {sum - i})'
if text == " ": # пустая строка
    text = "Исходные данные не верны!"

print(text)
